tylertms/dspic33e-sim/conformance/can.c
static void interrupt_flag_write_zero_cases(CanConformance* state, Dspic33* cpu) {
    static const uint16_t previous_words[] = {0x00efu, 0x0000u, 0x00a5u};
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint16_t address = (uint16_t)(bases[channel] + 0x0au);
        uint8_t previous_index;
        dspic33_reset(cpu, 0u);
        for (previous_index = 0u;
             previous_index < sizeof(previous_words) / sizeof(previous_words[0]);
             previous_index++) {
            uint16_t previous = previous_words[previous_index];
            uint32_t requested;
            for (requested = 0u; requested <= UINT16_MAX; requested++) {
                write_memory_word(cpu, address, previous);
                dspic33_write_word(cpu, address, (uint16_t)requested);
                expect(state,
                       dspic33_read_word(cpu, address) ==
                           (uint16_t)(previous & requested),
                       "interrupt flag write-zero clear domain");
            }
        }
    }
}

static void standard_filter_domain(CanConformance* state, Dspic33* cpu) {
    uint16_t identifier;
    uint16_t expected = 0x5a0u;
    uint16_t mask = 0x7f0u;
    Dspic33CanFrame input;
    dspic33_reset(cpu, 0u);
    configure_receive(cpu, 0u, 0x2000u, 4u, 0u);
    configure_filter(cpu, 0u, 0u, expected, false, mask, true, 0u, 0u);
    enable_filter(cpu, 0u, 1u);
    select_window(cpu, 0u, false);
    set_mode(cpu, 0u, 0u);
    for (identifier = 0u; identifier <= 0x7ffu; identifier++) {
        bool accepted = (identifier & mask) == (expected & mask);
        input = frame(identifier, false, false, 2u, (uint8_t)identifier);
        expect(state, dspic33_can_receive(cpu, 0u, &input, 0u),
               "standard domain schedule");
        expect(state, dspic33_device_advance(cpu, 32u), "standard domain advance");
        expect(state, receive_full(cpu, 0u, 0u) == accepted,
               "standard domain filter result");
        if (accepted) {
            expect(state, memory_word(cpu, 0x2000u) == (uint16_t)(identifier << 2u),
                   "standard domain identifier storage");
            clear_receive_flag(cpu, 0u, 0u);
        }
    }
}

static void extended_filter_cases(CanConformance* state, Dspic33* cpu) {
    static const uint32_t identifiers[] = {
        0u, 1u, 0x3ffffu, 0x40000u, 0x1ffffffu, 0x10000000u, 0x15555555u, 0x1fffffffu};
    uint8_t channel;
    uint8_t index;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        for (index = 0u; index < sizeof(identifiers) / sizeof(identifiers[0]);
             index++) {
            uint32_t identifier = identifiers[index];
            Dspic33CanFrame input = frame(identifier, true, false, 8u, index);
            dspic33_reset(cpu, 0u);
            configure_receive(cpu, channel, 0x3000u, 6u, 0u);
            configure_filter(cpu, channel, 3u, identifier, true, 0x1fffffffu, true, 6u,
                             1u);
            enable_filter(cpu, channel, 1u << 3u);
            select_window(cpu, channel, false);
            set_mode(cpu, channel, 0u);
            expect(state,
                   dspic33_can_receive(cpu, channel, &input, 0u) &&
                       dspic33_device_advance(cpu, 32u),
                   "extended exact transfer");
            expect(state, receive_full(cpu, channel, 6u), "extended exact full flag");
            expect(state,
                   (((uint32_t)(memory_word(cpu, 0x3060u) >> 2u) & 0x7ffu) << 18u) ==
                       (identifier & 0x1ffc0000u),
                   "extended SID storage");
            expect(state,
                   (((uint32_t)(memory_word(cpu, 0x3062u) & 0x0fffu) << 6u) |
                    (memory_word(cpu, 0x3064u) >> 10u)) == (identifier & 0x3ffffu),
                   "extended EID storage");
        }
    }
}

static void payload_and_remote_cases(CanConformance* state, Dspic33* cpu) {
    uint8_t channel;
    uint8_t length;
    uint8_t extended;
    uint8_t remote;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        for (extended = 0u; extended < 2u; extended++) {
            for (remote = 0u; remote < 2u; remote++) {
                for (length = 0u; length <= 8u; length++) {
                    uint32_t identifier = extended != 0u ? 0x1234567u : 0x567u;
                    Dspic33CanFrame input =
                        frame(identifier, extended != 0u, remote != 0u, length,
                              (uint8_t)(0x20u + length));
                    uint8_t index;
                    dspic33_reset(cpu, 0u);
                    configure_receive(cpu, channel, 0x4000u, 4u, 0u);
                    configure_filter(cpu, channel, 0u, identifier, extended != 0u,
                                     extended != 0u ? 0x1fffffffu : 0x7ffu, true, 2u,
                                     0u);
                    enable_filter(cpu, channel, 1u);
                    select_window(cpu, channel, false);
                    set_mode(cpu, channel, 0u);
                    expect(state,
                           dspic33_can_receive(cpu, channel, &input, 0u) &&
                               dspic33_device_advance(cpu, 32u),
                           "payload transfer");
                    expect(state, (memory_word(cpu, 0x4024u) & 0x0fu) == length,
                           "payload length");
                    for (index = 0u; index < length; index++) {
                        uint16_t word =
                            memory_word(cpu, (uint32_t)(0x4026u + (index / 2u) * 2u));
                        expect(state,
                               (uint8_t)(word >> ((index & 1u) * 8u)) ==
                                   input.data[index],
                               "payload byte");
                    }
                    expect(state,
                           extended != 0u ? ((memory_word(cpu, 0x4024u) & 0x0200u) !=
                                             0u) == (remote != 0u)
                                          : ((memory_word(cpu, 0x4020u) & 2u) != 0u) ==
                                                (remote != 0u),
                           "remote encoding");
                }
            }
        }
    }
}

static void devicenet_cases(CanConformance* state, Dspic33* cpu) {
    uint8_t bits;
    uint8_t length;
    for (bits = 1u; bits <= 31u; bits++) {
        for (length = 0u; length <= 3u; length++) {
            Dspic33CanFrame input = frame(0x321u, false, false, length, 0xa5u);
            uint32_t data = 0u;
            uint8_t compared = bits > 18u ? 18u : bits;
            if (compared > length * 8u) {
                compared = (uint8_t)(length * 8u);
            }
            if (length > 0u) {
                data = (uint32_t)input.data[0] << 16u;
            }
            if (length > 1u) {
                data |= (uint32_t)input.data[1] << 8u;
            }
            if (length > 2u) {
                data |= input.data[2];
            }
            data = compared == 0u ? 0u : (data >> (24u - compared)) << (18u - compared);
            dspic33_reset(cpu, 0u);
            configure_receive(cpu, 0u, 0x5000u, 4u, 0u);
            configure_filter(cpu, 0u, 0u, 0x321u, false, 0x7ffu, true, 0u, 0u);
            select_window(cpu, 0u, true);
            dspic33_write_word(cpu, 0x0430u, (uint16_t)((0x7ffu << 5u) | 8u));
            dspic33_write_word(cpu, 0x0440u,
                               (uint16_t)((0x321u << 5u) | (data >> 16u)));
            dspic33_write_word(cpu, 0x0442u, (uint16_t)data);
            enable_filter(cpu, 0u, 1u);
            dspic33_write_word(cpu, 0x0402u, bits);
            select_window(cpu, 0u, false);
            set_mode(cpu, 0u, 0u);
            expect(state,
                   dspic33_can_receive(cpu, 0u, &input, 0u) &&
                       dspic33_device_advance(cpu, 32u),
                   "DeviceNet matching transfer");
            expect(state, receive_full(cpu, 0u, 0u), "DeviceNet match");
        }
    }
}

