tylertms/dspic33e-sim/conformance/can.c
static void direct_buffer_cases(CanConformance* state, Dspic33* cpu) {
    uint8_t channel;
    uint8_t buffer;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        for (buffer = 0u; buffer <= 14u; buffer++) {
            Dspic33CanFrame input =
                frame((uint32_t)(0x200u + buffer), false, false, 4u, buffer);
            dspic33_reset(cpu, 0u);
            configure_receive(cpu, channel, 0x6000u, 6u, 0u);
            configure_filter(cpu, channel, 0u, input.identifier, false, 0x7ffu, true,
                             buffer, 0u);
            enable_filter(cpu, channel, 1u);
            select_window(cpu, channel, false);
            set_mode(cpu, channel, 0u);
            expect(state,
                   dspic33_can_receive(cpu, channel, &input, 0u) &&
                       dspic33_device_advance(cpu, 32u),
                   "direct buffer transfer");
            expect(state, receive_full(cpu, channel, buffer), "direct buffer full");
            expect(state,
                   memory_word(cpu, (uint32_t)(0x6000u + buffer * 16u)) ==
                       (uint16_t)(input.identifier << 2u),
                   "direct buffer address");
            expect(state,
                   (dspic33_read_word(cpu, (uint16_t)(bases[channel] + 0x0au)) & 2u) !=
                       0u,
                   "direct receive event");
        }
    }
}

static void fifo_cases(CanConformance* state, Dspic33* cpu) {
    static const uint8_t sizes[] = {4u, 6u, 8u, 12u, 16u, 24u, 32u};
    uint8_t selection;
    for (selection = 0u; selection < sizeof(sizes); selection++) {
        uint8_t size = sizes[selection];
        uint8_t start = (uint8_t)(size / 2u);
        uint8_t count = (uint8_t)(size - start);
        uint8_t index;
        dspic33_reset(cpu, 0u);
        configure_receive(cpu, 0u, 0x7000u, selection, start);
        configure_filter(cpu, 0u, 0u, 0x456u, false, 0x7ffu, true, 15u, 0u);
        enable_filter(cpu, 0u, 1u);
        select_window(cpu, 0u, false);
        set_mode(cpu, 0u, 0u);
        for (index = 0u; index < count; index++) {
            Dspic33CanFrame input = frame(0x456u, false, false, 1u, index);
            uint8_t buffer = (uint8_t)(start + index);
            expect(state,
                   dspic33_can_receive(cpu, 0u, &input, 0u) &&
                       dspic33_device_advance(cpu, 32u),
                   "FIFO transfer");
            expect(state, receive_full(cpu, 0u, buffer), "FIFO full sequence");
            expect(state,
                   memory_word(cpu, (uint32_t)(0x7000u + buffer * 16u + 6u)) == index,
                   "FIFO payload sequence");
        }
        expect(state, ((dspic33_read_word(cpu, 0x0408u) >> 8u) & 0x3fu) == start,
               "FIFO write pointer wrap");
        {
            Dspic33CanFrame overflow = frame(0x456u, false, false, 1u, 0xeeu);
            expect(state,
                   dspic33_can_receive(cpu, 0u, &overflow, 0u) &&
                       dspic33_device_advance(cpu, 2u),
                   "FIFO overflow transfer attempt");
            expect(state,
                   (dspic33_read_word(cpu,
                                      (uint16_t)(0x0428u + (start >= 16u ? 2u : 0u))) &
                    (uint16_t)(1u << (start & 15u))) != 0u,
                   "FIFO overflow flag");
            expect(state, (dspic33_read_word(cpu, 0x040au) & 4u) != 0u,
                   "FIFO overflow interrupt flag");
        }
        clear_receive_flag(cpu, 0u, start);
        expect(state, (dspic33_read_word(cpu, 0x0408u) & 0x3fu) == start + 1u,
               "FIFO next read pointer");
    }
}

static void select_transmit_buffer(Dspic33* cpu, uint8_t channel, uint8_t buffer) {
    uint16_t address = (uint16_t)(bases[channel] + 0x30u + (buffer / 2u) * 2u);
    uint8_t shift = (uint8_t)((buffer & 1u) * 8u);
    uint16_t value = dspic33_read_word(cpu, address);
    value =
        (uint16_t)((value & ~(uint16_t)(0xffu << shift)) | (uint16_t)(0x80u << shift));
    dspic33_write_word(cpu, address, value);
}

static bool transmit_buffer_selected(Dspic33* cpu, uint8_t channel, uint8_t buffer) {
    uint16_t address = (uint16_t)(bases[channel] + 0x30u + (buffer / 2u) * 2u);
    uint8_t shift = (uint8_t)((buffer & 1u) * 8u);
    return ((dspic33_read_word(cpu, address) >> shift) & 0x80u) != 0u;
}

static void fifo_overflow_advancement_case(CanConformance* state, Dspic33* cpu,
                                           uint8_t channel, bool listen_all, bool full,
                                           bool wrap) {
    uint16_t base = bases[channel];
    uint32_t memory = (uint32_t)(0xf000u + channel * 0x100u);
    Dspic33CanFrame input = frame(0x456u, false, false, 1u, 0x80u);
    uint8_t buffer = wrap ? 3u : 2u;
    uint8_t expected_next = wrap ? 2u : 3u;
    uint16_t flag = (uint16_t)(1u << buffer);
    uint16_t fnrb;
    dspic33_reset(cpu, 0u);
    configure_receive(cpu, channel, memory, 0u, 2u);
    configure_filter(cpu, channel, 0u, input.identifier, false, 0x7ffu, true, 15u, 0u);
    enable_filter(cpu, channel, 1u);
    select_window(cpu, channel, false);
    set_mode(cpu, channel, listen_all ? 7u : 0u);
    if (wrap) {
        expect(state,
               dspic33_can_receive(cpu, channel, &input, 0u) &&
                   dspic33_device_advance(cpu, 32u),
               "FIFO overflow wrap preparation");
        expect(state,
               ((dspic33_read_word(cpu, (uint16_t)(base + 8u)) >> 8u) & 0x3fu) ==
                   buffer,
               "FIFO overflow wrap pointer preparation");
        clear_receive_flag(cpu, channel, 2u);
    }
    if (full) {
        write_memory_word(cpu, (uint16_t)(base + 0x20u), flag);
    } else {
        select_transmit_buffer(cpu, channel, buffer);
    }
    write_memory_word(cpu, memory + buffer * 16u, 0xa55au);
    fnrb = (uint16_t)(dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x003fu);
    expect(state,
           dspic33_can_receive(cpu, channel, &input, 0u) &&
               dspic33_device_advance(cpu, 2u),
           "FIFO overflow receive attempt");
    expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 0x28u)) & flag) != 0u,
           "FIFO overflow buffer flag");
    expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 0x0au)) & 4u) != 0u,
           "FIFO overflow event flag");
    expect(state,
           ((dspic33_read_word(cpu, (uint16_t)(base + 8u)) >> 8u) & 0x3fu) ==
               expected_next,
           "FIFO overflow advances write pointer");
    expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 8u)) & 0x003fu) == fnrb,
           "FIFO overflow preserves next read pointer");
    expect(state, memory_word(cpu, memory + buffer * 16u) == 0xa55au,
           "FIFO overflow loses message");
    expect(state, receive_full(cpu, channel, buffer) == full,
           "FIFO overflow preserves selected buffer state");
    expect(state, full || transmit_buffer_selected(cpu, channel, buffer),
           "FIFO overflow preserves transmit selection");
}

static void fifo_overflow_advancement_cases(CanConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint8_t mode;
        for (mode = 0u; mode < 2u; mode++) {
            uint8_t cause;
            for (cause = 0u; cause < 2u; cause++) {
                uint8_t wrap;
                for (wrap = 0u; wrap < 2u; wrap++) {
                    fifo_overflow_advancement_case(state, cpu, channel, mode != 0u,
                                                   cause == 0u, wrap != 0u);
                }
            }
        }
    }
}

static void receive_flag_write_zero_domain(CanConformance* state, Dspic33* cpu) {
    static const uint8_t offsets[] = {0x20u, 0x22u, 0x28u, 0x2au};
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint8_t index;
        dspic33_reset(cpu, 0u);
        select_window(cpu, channel, false);
        for (index = 0u; index < sizeof(offsets); index++) {
            uint16_t address = (uint16_t)(bases[channel] + offsets[index]);
            uint32_t requested;
            for (requested = 0u; requested <= UINT16_MAX; requested++) {
                write_memory_word(cpu, address, UINT16_MAX);
                dspic33_write_word(cpu, address, (uint16_t)requested);
                expect(state, dspic33_read_word(cpu, address) == requested,
                       "receive flag write-zero domain");
            }
        }
    }
}

