tylertms/dspic33e-sim/conformance/can.c
static void receive_overflow_write_zero_prior_domain(CanConformance* state,
                                                     Dspic33* cpu) {
    static const uint8_t offsets[] = {0x28u, 0x2au};
    static const uint16_t previous_words[] = {0x0000u, 0x5a5au};
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint8_t index;
        dspic33_reset(cpu, 0u);
        select_window(cpu, channel, false);
        for (index = 0u; index < sizeof(offsets); index++) {
            uint16_t address = (uint16_t)(bases[channel] + offsets[index]);
            uint8_t previous_index;
            for (previous_index = 0u;
                 previous_index < sizeof(previous_words) / sizeof(previous_words[0]);
                 previous_index++) {
                uint16_t previous = previous_words[previous_index];
                uint32_t requested;
                for (requested = 0u; requested <= UINT16_MAX; requested++) {
                    write_memory_word(cpu, address, previous);
                    dspic33_write_word(cpu, address, (uint16_t)requested);
                    expect(state,
                           dspic33_read_word(cpu, address) ==
                               (uint16_t)(previous & requested),
                           "receive overflow write-zero prior domain");
                }
            }
        }
    }
}

static void receive_flag_read_pointer_cases(CanConformance* state, Dspic33* cpu) {
    static const uint8_t sizes[] = {4u, 6u, 8u, 12u, 16u, 24u, 32u};
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint8_t selection;
        for (selection = 0u; selection < sizeof(sizes); selection++) {
            uint8_t size = sizes[selection];
            uint8_t start = (uint8_t)(size / 2u);
            uint8_t buffer;
            for (buffer = start; buffer < size; buffer++) {
                uint16_t address =
                    (uint16_t)(bases[channel] + 0x20u + (buffer >= 16u ? 2u : 0u));
                uint16_t bit = (uint16_t)(1u << (buffer & 15u));
                uint16_t fifo_address = (uint16_t)(bases[channel] + 8u);
                uint8_t expected = buffer + 1u == size ? start : (uint8_t)(buffer + 1u);
                dspic33_reset(cpu, 0u);
                configure_receive(cpu, channel, 0xf800u, selection, start);
                select_window(cpu, channel, false);
                write_memory_word(cpu, address, bit);
                write_memory_word(cpu, fifo_address,
                                  (uint16_t)(((uint16_t)start << 8u) | 0x003fu));
                dspic33_write_word(cpu, address, (uint16_t)~bit);
                expect(state, dspic33_read_word(cpu, address) == 0u,
                       "FIFO receive flag clear");
                expect(state,
                       (dspic33_read_word(cpu, fifo_address) & 0x003fu) == expected,
                       "FIFO receive flag advances read pointer");
                expect(state,
                       (dspic33_read_word(cpu, fifo_address) & 0x3f00u) ==
                           (uint16_t)((uint16_t)start << 8u),
                       "FIFO receive flag preserves write pointer");
            }
            if (start != 0u) {
                uint8_t buffer = (uint8_t)(start - 1u);
                uint16_t address = (uint16_t)(bases[channel] + 0x20u);
                uint16_t bit = (uint16_t)(1u << buffer);
                uint16_t fifo_address = (uint16_t)(bases[channel] + 8u);
                dspic33_reset(cpu, 0u);
                configure_receive(cpu, channel, 0xf800u, selection, start);
                select_window(cpu, channel, false);
                write_memory_word(cpu, address, bit);
                write_memory_word(cpu, fifo_address,
                                  (uint16_t)(((uint16_t)start << 8u) | 0x003eu));
                dspic33_write_word(cpu, address, (uint16_t)~bit);
                expect(state,
                       (dspic33_read_word(cpu, fifo_address) & 0x003fu) == 0x003eu,
                       "direct receive flag preserves FIFO read pointer");
            }
        }
    }
}

static void fifo_interrupt_boundary_case(CanConformance* state, Dspic33* cpu,
                                         uint8_t channel, bool wrap, uint8_t relation) {
    uint16_t base = bases[channel];
    uint16_t fifo_address = (uint16_t)(base + 8u);
    uint16_t interrupt_address = (uint16_t)(base + 0x0au);
    uint32_t memory = (uint32_t)(0xf800u + channel * 0x100u);
    Dspic33CanFrame input = frame(0x456u, false, false, 1u, 0x90u);
    uint8_t preparation = wrap ? 2u : 0u;
    uint8_t index;
    uint8_t expected_fbp = wrap ? 5u : 3u;
    uint8_t fnrb;
    bool asserted = relation == FIFO_RELATION_THRESHOLD;
    if (asserted) {
        fnrb = wrap ? 2u : 4u;
    } else if (relation == FIFO_RELATION_EQUAL) {
        fnrb = expected_fbp;
    } else {
        fnrb = wrap ? 3u : 5u;
    }
    dspic33_reset(cpu, 0u);
    configure_receive(cpu, channel, memory, 1u, 2u);
    configure_filter(cpu, channel, 0u, input.identifier, false, 0x7ffu, true, 15u, 0u);
    enable_filter(cpu, channel, 1u);
    select_window(cpu, channel, false);
    set_mode(cpu, channel, 0u);
    for (index = 0u; index < preparation; index++) {
        expect(state,
               dspic33_can_receive(cpu, channel, &input, 0u) &&
                   dspic33_device_advance(cpu, 32u),
               "FIFO interrupt boundary preparation");
    }
    write_memory_word(
        cpu, fifo_address,
        (uint16_t)((dspic33_read_word(cpu, fifo_address) & 0x3f00u) | fnrb));
    dspic33_write_word(
        cpu, interrupt_address,
        (uint16_t)(dspic33_read_word(cpu, interrupt_address) & ~0x000au));
    dspic33_write_word(cpu, (uint16_t)(base + 0x0cu), 0x0008u);
    clear_interrupt_flag(cpu, event_irqs[channel]);
    expect(state,
           dspic33_can_receive(cpu, channel, &input, 0u) &&
               dspic33_device_advance(cpu, 32u),
           "FIFO interrupt boundary receive");
    expect(state,
           ((dspic33_read_word(cpu, fifo_address) >> 8u) & 0x003fu) == expected_fbp,
           "FIFO interrupt uses updated write pointer");
    expect(state, (dspic33_read_word(cpu, fifo_address) & 0x003fu) == fnrb,
           "FIFO interrupt preserves read pointer");
    expect(state,
           ((dspic33_read_word(cpu, interrupt_address) & 0x0008u) != 0u) == asserted,
           "FIFO interrupt boundary result");
    expect(state, interrupt_flag(cpu, event_irqs[channel]) == asserted,
           "FIFO interrupt boundary IFS result");
    expect(state,
           (dspic33_read_word(cpu, (uint16_t)(base + 4u)) & 0x007fu) ==
               (asserted ? 0x44u : 0x40u),
           "FIFO interrupt boundary vector result");
}

static void fifo_interrupt_boundary_cases(CanConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint8_t wrap;
        for (wrap = 0u; wrap < 2u; wrap++) {
            uint8_t relation;
            for (relation = FIFO_RELATION_THRESHOLD; relation <= FIFO_RELATION_DISTANT;
                 relation++) {
                fifo_interrupt_boundary_case(state, cpu, channel, wrap != 0u, relation);
            }
        }
    }
}

static void receive_flag_hardware_event_case(CanConformance* state, Dspic33* cpu,
                                             uint8_t channel, uint8_t target) {
    uint16_t base = bases[channel];
    uint16_t fifo_address = (uint16_t)(base + 8u);
    uint16_t interrupt_address = (uint16_t)(base + 0x0au);
    uint16_t overflow_address = (uint16_t)(base + 0x28u + (target >= 16u ? 2u : 0u));
    uint16_t target_bit = (uint16_t)(1u << (target & 15u));
    uint32_t memory = (uint32_t)(0xf000u + channel * 0x400u);
    uint16_t preserved_words[8];
    uint8_t buffer;
    uint8_t word;
    dspic33_reset(cpu, 0u);
    configure_receive(cpu, channel, memory, 6u, target);
    configure_filter(cpu, channel, 0u, 0x456u, false, 0x7ffu, true, 15u, 0u);
    enable_filter(cpu, channel, 1u);
    select_window(cpu, channel, false);
    set_mode(cpu, channel, 0u);
    for (buffer = target; buffer < 32u; buffer++) {
        Dspic33CanFrame input =
            frame(0x456u, false, false, 1u, (uint8_t)(0x20u + buffer));
        uint8_t expected_fbp = buffer == 31u ? target : (uint8_t)(buffer + 1u);
        expect(state,
               dspic33_can_receive(cpu, channel, &input, 0u) &&
                   dspic33_device_advance(cpu, 32u),
               "receive flag hardware fill event");
        expect(state, receive_full(cpu, channel, buffer),
               "receive flag hardware sets RXFUL");
        expect(state,
               memory_word(cpu, memory + buffer * 16u + 6u) ==
                   (uint8_t)(0x20u + buffer),
               "receive flag hardware stores message");
        expect(state,
               ((dspic33_read_word(cpu, fifo_address) >> 8u) & 0x003fu) == expected_fbp,
               "receive flag hardware advances write pointer");
        expect(state, (dspic33_read_word(cpu, fifo_address) & 0x003fu) == target,
               "receive flag hardware preserves read pointer");
    }
    for (word = 0u; word < 8u; word++) {
        preserved_words[word] = memory_word(cpu, memory + target * 16u + word * 2u);
    }
    expect(state, (dspic33_read_word(cpu, overflow_address) & target_bit) == 0u,
           "receive overflow flag initially clear");
    expect(state, (dspic33_read_word(cpu, interrupt_address) & 0x0004u) == 0u,
           "receive overflow interrupt initially clear");
    {
        Dspic33CanFrame overflow = frame(0x456u, false, false, 1u, 0xe0u);
        uint8_t expected_fbp = target == 31u ? target : (uint8_t)(target + 1u);
        expect(state,
               dspic33_can_receive(cpu, channel, &overflow, 0u) &&
                   dspic33_device_advance(cpu, 2u),
               "receive overflow hardware event");
        expect(state, receive_full(cpu, channel, target),
               "receive overflow preserves RXFUL");
        expect(state, (dspic33_read_word(cpu, overflow_address) & target_bit) != 0u,
               "receive overflow hardware sets RXOVF");
        expect(state, (dspic33_read_word(cpu, interrupt_address) & 0x0004u) != 0u,
               "receive overflow hardware sets RBOVIF");
        expect(state,
               ((dspic33_read_word(cpu, fifo_address) >> 8u) & 0x003fu) == expected_fbp,
               "receive overflow advances write pointer");
        expect(state, (dspic33_read_word(cpu, fifo_address) & 0x003fu) == target,
               "receive overflow preserves read pointer");
        for (word = 0u; word < 8u; word++) {
            expect(state,
                   memory_word(cpu, memory + target * 16u + word * 2u) ==
                       preserved_words[word],
                   "receive overflow loses complete message");
        }
    }
}

static void receive_flag_hardware_event_cases(CanConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_CAN_COUNT; channel++) {
        uint8_t target;
        for (target = 0u; target < 32u; target++) {
            receive_flag_hardware_event_case(state, cpu, channel, target);
        }
    }
}

